Classes | Public Member Functions | Static Public Member Functions | List of all members
ACAPI::MEP::Branch Class Referencefinal
MEP Element Manager
A branch is a specific type of fitting that acts as an outlet from a large pipe to a smaller pipe or one of equal size. More...
#include <MEPBranch.hpp>
 Inheritance diagram for ACAPI::MEP::Branch:
 Classes
class  | Modifier
Modifier of the Branch. More...
 Public Member Functions
BranchDefault  | PickUpDefault () const
Picks up the Default from the Branch.
std::optional< double >  | GetInsulationThickness () const
double  | GetLength () const
double  | GetBranchLength () const
double  | GetBranchAngle () const
double  | GetBranchOffset () const
Domain  | GetDomain () const
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
 Public Member Functions inherited from ACAPI::MEP::ModifiableElementBase
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
 Public Member Functions inherited from ACAPI::MEP::ElementBase
bool  | Exists () const
std::vector< UniqueID >  | GetPortIDs () const
std::vector< UniqueID >  | GetDirectConnectedMEPElementIds () const
API_Coord3D  | GetAnchorPoint () const
Orientation  | GetOrientation () const
API_Guid  | GetObjectId () const
 Public Member Functions inherited from ACAPI::ElementBase
UniqueID  | GetElemId () const
Get unique identifier of the ElementBase object.
Result< void >  | IsEditable () const
Checks whether the element is editable.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Static Public Member Functions
static Result< Branch >  | Get (const UniqueID &uniqueId)
Returns a Branch.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::MEP::ModifiableElementBase
ModifiableElementBase (std::shared_ptr< Impl::IElementBaseImpl > impl)
Constructs a ModifiableElementBase with the IElementBaseImpl.
 Protected Member Functions inherited from ACAPI::MEP::ElementBase
ElementBase (std::shared_ptr< Impl::IElementBaseImpl > impl)
Constructs an ElementBase with an element base implementation.
 Protected Member Functions inherited from ACAPI::ElementBase
ElementBase (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new ElementBase.
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
A branch is a specific type of fitting that acts as an outlet from a large pipe to a smaller pipe or one of equal size.
Since
Archicad 27
This type of element can be placed at intersections
Example code snippets from Test / New MEP
Getters
 ACAPI::Result<Branch> branch = Branch::Get (id);
 if (branch.IsErr ()) {
 ACAPI_WriteReport (branch.UnwrapErr ().text.c_str (), false);
 return;
 }
 Reporter branchReporter;
 branchReporter.Add ("Branch details");
 branchReporter.SetTabCount (1);
 branchReporter.Add ("Main axis length", branch->GetLength ());
 branchReporter.Add ("Branch length", branch->GetBranchLength ());
 branchReporter.Add ("Branch angle", branch->GetBranchAngle ());
 branchReporter.Add ("Branch offset", branch->GetBranchOffset ());
 std::optional<double> insulationThickness = branch->GetInsulationThickness ();
 insulationThickness.has_value () ? branchReporter.Add ("It has insulation. Thickness", *insulationThickness) : branchReporter.Add ("It has no insulation");
 branchReporter.Write ();
Member Function Documentation
◆ Get()
 static Result< Branch > ACAPI::MEP::Branch::Get  |  ( |  const UniqueID & |  uniqueId | )
static
Returns a Branch.
Parameters
uniqueId | The UniqueID of the requested Branch.
Returns
If the uniqueId belongs to a Branch, returns the object associated to it, otherwise Error.
◆ GetBranchAngle()
 double ACAPI::MEP::Branch::GetBranchAngle  |  ( |   | ) |   const
Returns
Returns the angle of the branch of the element in degrees.
◆ GetBranchLength()
 double ACAPI::MEP::Branch::GetBranchLength  |  ( |   | ) |   const
Returns
Returns the length of the branch of the Branch.
◆ GetBranchOffset()
 double ACAPI::MEP::Branch::GetBranchOffset  |  ( |   | ) |   const
Returns
Returns the offset of the branch of the Branch.
◆ GetDomain()
 Domain ACAPI::MEP::Branch::GetDomain  |  ( |   | ) |   const
Returns
Returns the domain of the Branch.
◆ GetInsulationThickness()
 std::optional< double > ACAPI::MEP::Branch::GetInsulationThickness  |  ( |   | ) |   const
Returns
Returns the insulation thickness if the Branch has insulation, otherwise std::nullopt. Branches of cable carrier domain cannot have insulation.
◆ GetLength()
 double ACAPI::MEP::Branch::GetLength  |  ( |   | ) |   const
Returns
Returns the length of the main axis of the Branch.
◆ Modify()
 template<typename ModifierFunc >
 Result< void > ACAPI::MEP::Branch::Modify  |  ( |  const ModifierFunc & |  modifierFunc,
|  const GS::UniString & |  undoString )
Executes the passed modifier scope in an Undoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
undoString | The text which appears in the undo queue of Archicad after executing the command.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.
◆ PickUpDefault()
 BranchDefault ACAPI::MEP::Branch::PickUpDefault  |  ( |   | ) |   const
Picks up the Default from the Branch.
Returns
Returns a BranchDefault with the parameters of the object it was called for.